<?php if(!defined('__CP__'))die();
define('LNG_SYS', 'РџР°СЂР°РјРµС‚СЂС‹');

define('LNG_SYS_REPORTS',      'РћС‚С‡РµС‚С‹');
define('LNG_SYS_REPORTS_PATH', 'Р›РѕРєР°Р»СЊРЅС‹Р№ РїСѓС‚СЊ:');
define('LNG_SYS_REPORTS_TODB', 'Р—Р°РїРёСЃСЊ РѕС‚С‡РµС‚РѕРІ РІ Р±Р°Р·Сѓ РґР°РЅРЅС‹С….');
define('LNG_SYS_REPORTS_TOFS', 'Р—Р°РїРёСЃСЊ РѕС‚С‡РµС‚РѕРІ РІ Р»РѕРєР°Р»СЊРЅС‹Р№ РїСѓС‚СЊ.');

define('LNG_SYS_BOTNET',          'Р‘РѕС‚РЅРµС‚');
define('LNG_SYS_BOTNET_TIMEOUT',  'РўР°Р№РјР°СѓС‚ РѕРЅР»Р°Р№РЅ-СЃС‚Р°С‚СѓСЃР° (РјРёРЅСѓС‚С‹):');
define('LNG_SYS_BOTNET_CRYPTKEY', 'РљР»СЋС‡ С€РёС„СЂРѕРІР°РЅРёСЏ:');

define('LNG_SYS_E1', 'РќРµ РІРµСЂРЅРѕ СѓРєР°Р·Р°РЅ Р»РѕРєР°Р»СЊРЅС‹Р№ РїСѓС‚СЊ РґР»СЏ РѕС‚С‡РµС‚РѕРІ.');
define('LNG_SYS_E2', 'РќРµ РІРµСЂРЅРѕ СѓРєР°Р·Р°РЅРѕ РІСЂРµРјСЏ С‚Р°Р№РјР°СѓС‚Р° РґР»СЏ Р±РѕС‚РЅРµС‚Р°.');
define('LNG_SYS_E3', 'РќРµ РІРµСЂРЅРѕ СѓРєР°Р·Р°РЅ РєР»СЋС‡ С€РёС„СЂРѕРІР°РЅРёСЏ РґР»СЏ Р±РѕС‚РЅРµС‚Р°.');
define('LNG_SYS_E4', 'РќРµ СѓРґР°Р»РѕСЃСЊ РѕР±РЅРѕРІРёС‚СЊ С„Р°Р№Р» РєРѕРЅС„РёРіСѓСЂР°С†РёРё, РІРѕР·РјРѕР¶РЅРѕ РЅРµ РґРѕСЃС‚Р°С‚РѕС‡РЅРѕ РїСЂР°РІ.');

define('LNG_SYS_SAVE', 'РЎРѕС…СЂР°РЅРёС‚СЊ');

define('LNG_SYS_UPDATED', 'РќР°СЃС‚СЂРѕР№РєРё СѓСЃРїРµС€РЅРѕ РѕР±РЅРѕРІР»РµРЅС‹.');
?>