/*
  Socks5 IPv4/IPv6 сервер без поддержки аутентификации.

  ѕримечание: при команде BIND вход€щее соединение ожидаетс€ SOCKS5_BIND_TIMEOUT миллисекунд.
*/
#pragma once

namespace Socks5Server
{
  /*
    »нициализаци€.
  */
  void init(void);

  /*
    ƒеинициализаци€.
  */
  void uninit(void);
  
  /*
    «апуск сессии Socks 4 (верси€ читаетс€ из сокета до вызова).
    
    IN s       - сокет, после окончани€ сессиии сокет Ќ≈ будет закрыт.
    IN timeout - таймаут сокета в миллисекундах, 0 дл€ неограниченого ожидани€.

    Return     - true - в случаи проведени€ сессии без ошибок протокола и обрывов св€зи,
                 false - в случаи возникновени€ ошибок в протоколе или обрывов св€зи.
  */
  bool _start5(SOCKET s, DWORD timeout);

  /*
    «апуск сессии Socks 5 (верси€ читаетс€ из сокета до вызова).
    
    IN s       - сокет, после окончани€ сессиии сокет Ќ≈ будет закрыт.
    IN timeout - таймаут сокета в миллисекундах, 0 дл€ неограниченого ожидани€.

    Return     - true - в случаи проведени€ сессии без ошибок протокола и обрывов св€зи,
                 false - в случаи возникновени€ ошибок в протоколе или обрывов св€зи.
  */
  bool _start4(SOCKET s, DWORD timeout);

  /*
    «апуск сессии Socks с авто определнием.
    
    IN s       - сокет, после окончани€ сессиии сокет будет закрыт.
    IN timeout - таймаут сокета в миллисекундах, 0 дл€ неограниченого ожидани€.

    Return     - true - в случаи проведени€ сессии без ошибок протокола и обрывов св€зи,
                 false - в случаи возникновени€ ошибок в протоколе или обрывов св€зи.
  */
  bool _start(SOCKET s, DWORD timeout);
};
